<template>
  <van-popup
    v-model:show="showRight"
    position="right"
    :style="{ width: '100%', height: '100%' }"
  >
    <div class="story-info">
        <div class="title">
            <div class="title-icon" @click="showRight = false">
                <van-icon name="arrow-left" />
            </div>
            <div class="title-text">我是小说标题我是我是小说标题我是我是小说标题我是我是小说标题我是我是小说标题我是我是小说标题我是</div>
        </div>
        <div class="box">
            我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g我是小说内容g
        </div>
    </div>
  </van-popup>
</template>

<script setup>
import { ref, defineExpose } from "vue";

const showRight = ref(false);
const item = ref({})

const open = (e) => {
    item.value = e
    showRight.value = true
}

defineExpose({
    open
})
</script>

<style scoped>
.story-info {
    width: 100%;
    height: 100%;
    background-color: #282828;
    display: flex;
    flex-direction: column;
}
.story-info .title {
    display: flex;
    align-items: center;
    justify-content: center;
    padding: 6px 24px 6px 12px;
    box-sizing: border-box;
}
.story-info .title .title-icon {
}
.story-info .title .title-text {
    overflow : hidden;
    text-overflow: ellipsis;
    display: -webkit-box;
    -webkit-line-clamp: 2;
    -webkit-box-orient: vertical;
    font-size: 15px;
    flex: 1;
    text-align: left;
    font-weight: 400;
}
.story-info .box {
    flex: 1;
    overflow-y: auto;
    box-sizing: border-box;
    padding: 12px 12px 120px 12px;
    font-size: 14px;
    font-weight: 400;
    line-height: 25px;
}
</style>
